[
  {
    "id": 1,
    "name": "Lion",
    "scientific_name": "Panthera leo",
    "type": "Mammal",
    "habitat": "Prefers grasslands, savannas, and open woodlands. They are found in parts of Africa and a small population exists in India's Gir Forest.",
    "conservation_status": "Vulnerable",
    "status_threats": "Habitat loss, decline in prey base, and human-wildlife conflict.",
    "description": "A large carnivorous feline known for its muscular, deep-chested body and a distinctive roar. Males have a prominent mane.",
    "food": "Carnivore; preys on large to medium-sized mammals like wildebeest, zebra, buffalo, and deer.",
    "region": "Africa, India",
    "image": "images/lion.png"
  },
  {
    "id": 2,
    "name": "Tiger",
    "scientific_name": "Panthera tigris",
    "type": "Mammal",
    "habitat": "Inhabits a wide range of environments, including tropical rainforests, mangrove swamps, temperate forests, and grasslands.",
    "conservation_status": "Endangered",
    "status_threats": "Poaching for their fur and body parts, habitat loss and fragmentation, and human-wildlife conflict.",
    "description": "The largest cat species, recognizable by its coat of reddish-orange fur with dark vertical stripes.",
    "food": "Carnivore; hunts large prey such as deer, wild boar, and buffalo.",
    "region": "Asia",
    "image": "images/tiger.png"
  },
  {
    "id": 3,
    "name": "African Bush Elephant",
    "scientific_name": "Loxodonta africana",
    "type": "Mammal",
    "habitat": "Found in a variety of habitats including savannas, forests, marshes, and deserts across sub-Saharan Africa.",
    "conservation_status": "Endangered",
    "status_threats": "Poaching for ivory tusks and habitat loss due to human population expansion and agriculture.",
    "description": "The largest land animal on Earth, characterized by its long trunk, large ears that help radiate heat, and tusks present in both males and females.",
    "food": "Herbivore; eats roots, grasses, fruit, and bark.",
    "region": "Africa",
    "image": "images/african_bush_elephant.png"
  },
  {
    "id": 4,
    "name": "Giraffe",
    "scientific_name": "Giraffa camelopardalis",
    "type": "Mammal",
    "habitat": "Lives in the savannas, grasslands, and open woodlands of Africa, where they can find their preferred food trees.",
    "conservation_status": "Vulnerable",
    "status_threats": "Habitat loss and fragmentation, civil unrest, and poaching for their meat and hides.",
    "description": "The tallest mammal in the world, known for its extremely long neck and legs, and its distinctive coat patterns.",
    "food": "Herbivore; browses on leaves, flowers, and fruits from tall trees like acacia.",
    "region": "Africa",
    "image": "images/giraffe.png"
  },
  {
    "id": 5,
    "name": "Giant Panda",
    "scientific_name": "Ailuropoda melanoleuca",
    "type": "Mammal",
    "habitat": "Lives in a few mountain ranges in central China, in cool, wet temperate forests with a dense understory of bamboo.",
    "conservation_status": "Vulnerable",
    "status_threats": "Habitat fragmentation and loss due to farming and infrastructure development, which isolates populations.",
    "description": "A bear native to China, easily recognized by the large, distinctive black patches around its eyes, over the ears, and across its round body.",
    "food": "Herbivore; diet is over 99% bamboo, though they occasionally eat other grasses or small rodents.",
    "region": "China",
    "image": "images/giant_panda.png"
  },
  {
    "id": 6,
    "name": "Gray Wolf",
    "scientific_name": "Canis lupus",
    "type": "Mammal",
    "habitat": "Highly adaptable, found in a wide range of habitats including temperate forests, mountains, tundra, taiga, and grasslands.",
    "conservation_status": "Least Concern",
    "status_threats": "While globally stable, some populations face threats from habitat loss, human persecution, and loss of prey base.",
    "description": "A large canine native to Eurasia and North America. They are intelligent and social animals that live and hunt in complex family units called packs.",
    "food": "Carnivore; hunts large hoofed mammals like deer, elk, and moose, as well as smaller animals.",
    "region": "North America, Europe, Asia",
    "image": "images/gray_wolf.png"
  },
  {
    "id": 7,
    "name": "Red Fox",
    "scientific_name": "Vulpes vulpes",
    "type": "Mammal",
    "habitat": "Extremely adaptable, found in diverse habitats including forests, grasslands, mountains, deserts, and increasingly in suburban and urban areas.",
    "conservation_status": "Least Concern",
    "status_threats": "Generally stable, but can be affected by diseases like mange and rabies, and hunted by humans for fur or as pests.",
    "description": "The largest of the true foxes, known for its reddish-brown coat, bushy white-tipped tail (brush), and pointed ears and muzzle.",
    "food": "Omnivore; eats rodents, rabbits, birds, insects, as well as fruits and vegetables.",
    "region": "Northern Hemisphere, Australia",
    "image": "images/red_fox.png"
  },
  {
    "id": 8,
    "name": "Bald Eagle",
    "scientific_name": "Haliaeetus leucocephalus",
    "type": "Bird",
    "habitat": "Primarily found near large bodies of open water with an abundant food supply and old-growth trees for nesting, such as coasts, rivers, and large lakes.",
    "conservation_status": "Least Concern",
    "status_threats": "Previously threatened by pesticides (DDT), now faces threats from lead poisoning from ammunition, habitat loss, and collisions with vehicles and structures.",
    "description": "A large bird of prey with a white head and tail, dark brown body, and a large hooked yellow beak. It is the national bird of the United States.",
    "food": "Carnivore; primarily eats fish, but also hunts other birds, small mammals, and scavenges on carrion.",
    "region": "North America",
    "image": "images/bald_eagle.png"
  },
  {
    "id": 9,
    "name": "Emperor Penguin",
    "scientific_name": "Aptenodytes forsteri",
    "type": "Bird",
    "habitat": "Exclusively found in Antarctica, living and breeding on the stable 'fast ice' and foraging in the frigid Southern Ocean.",
    "conservation_status": "Near Threatened",
    "status_threats": "Climate change and the resulting loss of sea ice, which is critical for their breeding, feeding, and molting cycles.",
    "description": "The tallest and heaviest of all living penguin species. They are known for their epic breeding journeys and huddling behavior to survive the extreme cold.",
    "food": "Carnivore; diet consists mainly of fish, krill, and squid.",
    "region": "Antarctica",
    "image": "images/emperor_penguin.png"
  },
  {
    "id": 10,
    "name": "Blue Whale",
    "scientific_name": "Balaenoptera musculus",
    "type": "Mammal",
    "habitat": "Found in all oceans of the world. They migrate long distances between krill-rich feeding grounds in cold polar waters and breeding grounds in warmer tropical waters.",
    "conservation_status": "Endangered",
    "status_threats": "Historically decimated by whaling. Current threats include ship strikes and entanglement in fishing gear. Ocean noise pollution also disrupts their communication.",
    "description": "The largest animal on the planet. It is a baleen whale with a long, slender, mottled bluish-gray body.",
    "food": "Carnivore; filter-feeds almost exclusively on krill, tiny shrimp-like animals, consuming up to 4 tons per day.",
    "region": "All Oceans",
    "image": "images/blue_whale.png"
  },
  {
    "id": 11,
    "name": "Green Sea Turtle",
    "scientific_name": "Chelonia mydas",
    "type": "Reptile",
    "habitat": "Inhabits tropical and subtropical coastal waters around the world. Adults are often found in shallow lagoons, feeding on seagrass, while juveniles are found in open ocean habitats.",
    "conservation_status": "Endangered",
    "status_threats": "Overharvesting of eggs and adults, habitat loss of nesting beaches, bycatch in fisheries, boat strikes, and plastic pollution.",
    "description": "A large sea turtle with a wide, smooth carapace, or shell. It is named for the green-colored fat found beneath its shell, not the shell's color.",
    "food": "Herbivore as adults (eating seagrass and algae), but primarily carnivorous as juveniles.",
    "region": "Worldwide in tropical, subtropical waters",
    "image": "images/green_sea_turtle.png"
  },
  {
    "id": 12,
    "name": "Nile Crocodile",
    "scientific_name": "Crocodylus niloticus",
    "type": "Reptile",
    "habitat": "A freshwater species found in a wide variety of aquatic environments like rivers, lakes, marshes, and mangrove swamps.",
    "conservation_status": "Least Concern",
    "status_threats": "Localized threats include habitat destruction, water pollution, and hunting for their skin and meat.",
    "description": "A large, aggressive crocodilian that is an apex predator in its environment. It has a long snout and powerful jaws lined with conical teeth.",
    "food": "Carnivore; an opportunistic predator that eats a wide variety of prey, including fish, birds, and mammals that come to the water's edge.",
    "region": "Africa",
    "image": "images/nile_crocodile.png"
  },
  {
    "id": 13,
    "name": "Common Ostrich",
    "scientific_name": "Struthio camelus",
    "type": "Bird",
    "habitat": "Inhabits the savannas, deserts, and open woodlands of Africa. They are well-adapted to hot, dry climates.",
    "conservation_status": "Least Concern",
    "status_threats": "While globally stable, populations are threatened by hunting for feathers, meat, and eggs, as well as habitat loss to agriculture.",
    "description": "The world's largest and heaviest bird. It is flightless and known for its long neck and legs and its ability to run at speeds up to 70 km/h (45 mph).",
    "food": "Omnivore; primarily eats plants, roots, and seeds but will also eat insects, lizards, and other small creatures.",
    "region": "Africa",
    "image": "images/common_ostrich.png"
  },
  {
    "id": 14,
    "name": "Peregrine Falcon",
    "scientific_name": "Falco peregrinus",
    "type": "Bird",
    "habitat": "Found worldwide in a vast range of habitats, from polar regions to deserts. Often nests on cliffs, and has adapted well to tall city buildings.",
    "conservation_status": "Least Concern",
    "status_threats": "Historically devastated by pesticides like DDT. Current threats include building collisions and localized habitat disturbance.",
    "description": "A widespread bird of prey renowned for being the fastest animal in the world, capable of reaching speeds over 320 km/h (200 mph) during its hunting dive.",
    "food": "Carnivore; preys almost exclusively on medium-sized birds, which it catches in mid-air.",
    "region": "Worldwide",
    "image": "images/peregrine_falcon.png"
  },
  {
    "id": 15,
    "name": "Great White Shark",
    "scientific_name": "Carcharodon carcharias",
    "type": "Fish",
    "habitat": "Coastal and offshore waters in temperate and subtropical seas, with major concentrations near coasts with abundant marine mammal populations.",
    "conservation_status": "Vulnerable",
    "status_threats": "Overfishing (both targeted and as bycatch in other fisheries), pollution, and degradation of coastal habitats.",
    "description": "One of the largest and most powerful predatory fish in the world, known for its role as an apex predator in marine ecosystems.",
    "food": "Carnivore; diet includes seals, sea lions, dolphins, sea turtles, and large fish.",
    "region": "Worldwide coastal waters",
    "image": "images/great_white_shark.png"
  },
  {
    "id": 16,
    "name": "Chimpanzee",
    "scientific_name": "Pan troglodytes",
    "type": "Mammal",
    "habitat": "Tropical forests and wet savannas of Central and West Africa, from the canopy to the forest floor.",
    "conservation_status": "Endangered",
    "status_threats": "The primary threats are poaching for the bushmeat trade, habitat loss and fragmentation due to deforestation, and infectious diseases.",
    "description": "A species of great ape and one of humanity's closest living relatives. Chimpanzees are known for their high intelligence and complex social behaviors, including tool use.",
    "food": "Omnivore; primarily eats fruit, but also leaves, flowers, insects, and occasionally hunts smaller mammals like monkeys.",
    "region": "Africa",
    "image": "images/chimpanzee.png"
  },
  {
    "id": 17,
    "name": "Scarlet Macaw",
    "scientific_name": "Ara macao",
    "type": "Bird",
    "habitat": "Humid evergreen forests, tropical rainforests, and woodlands, typically in the upper canopy layer.",
    "conservation_status": "Least Concern",
    "status_threats": "While widespread, local populations are severely threatened by deforestation and illegal trapping for the pet trade.",
    "description": "A large and iconic parrot with brilliant red, yellow, and blue feathers. They are highly intelligent, social birds that often mate for life.",
    "food": "Herbivore; uses its powerful beak to crack open hard nuts and seeds, and also eats fruits and flowers.",
    "region": "Central and South America",
    "image": "images/scarlet_macaw.png"
  },
  {
    "id": 18,
    "name": "Komodo Dragon",
    "scientific_name": "Varanus komodoensis",
    "type": "Reptile",
    "habitat": "Found exclusively on a few Indonesian islands. They thrive in the islands' harsh climate of tropical savanna forests and open grasslands.",
    "conservation_status": "Endangered",
    "status_threats": "Habitat loss due to human activity and climate change (rising sea levels), and a decline in their large prey species.",
    "description": "The largest living species of lizard, known for its massive size, powerful limbs, and a venomous bite. It is the apex predator of its ecosystem.",
    "food": "Carnivore; an ambush predator that eats almost any meat, including large water buffalo, deer, carrion, and smaller dragons.",
    "region": "Indonesia",
    "image": "images/komodo_dragon.png"
  },
  {
    "id": 19,
    "name": "Polar Bear",
    "scientific_name": "Ursus maritimus",
    "type": "Mammal",
    "habitat": "Lives in the Arctic on sea ice, which they use as a platform to hunt seals at openings in the ice. They are considered a marine mammal.",
    "conservation_status": "Vulnerable",
    "status_threats": "The primary threat is the loss of its sea ice habitat due to global climate change. Other threats include pollution, oil and gas exploration, and human-bear conflicts.",
    "description": "The largest land carnivore, perfectly adapted for life in the harsh Arctic environment with a thick layer of blubber and a water-repellent coat.",
    "food": "Carnivore; their diet mainly consists of fat-rich ringed and bearded seals.",
    "region": "Arctic Circle",
    "image": "images/polar_bear.png"
  },
  {
    "id": 20,
    "name": "Atlantic Puffin",
    "scientific_name": "Fratercula arctica",
    "type": "Bird",
    "habitat": "A seabird that spends most of its life on the open ocean of the North Atlantic, only returning to coastal cliffs and islands to breed in large colonies.",
    "conservation_status": "Vulnerable",
    "status_threats": "Threats include declining food availability due to warming sea temperatures impacting small fish populations, predation by gulls and rats in colonies, and oil spills.",
    "description": "A small, unmistakable seabird with a stocky build and a large, brightly colored beak during the breeding season. Often nicknamed the 'clown of the sea'.",
    "food": "Carnivore; an excellent swimmer that dives to catch small fish like herring, hake, and sand eels.",
    "region": "North Atlantic Ocean",
    "image": "images/atlantic_puffin.png"
  },
  {
    "id": 21,
    "name": "Red Panda",
    "scientific_name": "Ailurus fulgens",
    "type": "Mammal",
    "habitat": "High-altitude temperate forests in the eastern Himalayas and southwestern China, with a dense understory of bamboo.",
    "conservation_status": "Endangered",
    "status_threats": "Habitat loss and fragmentation due to deforestation for agriculture and logging, as well as poaching for their fur and the illegal pet trade.",
    "description": "A small, arboreal mammal with reddish-brown fur, a long, shaggy tail for balance, and a waddling gait. Despite its name, it is not a close relative of the giant panda.",
    "food": "Herbivore; its diet consists almost entirely of bamboo, but it also eats fruit, acorns, roots, and eggs.",
    "region": "Eastern Himalayas, Southwestern China",
    "image": "images/red_panda.png"
  },
  {
    "id": 22,
    "name": "Orca (Killer Whale)",
    "scientific_name": "Orcinus orca",
    "type": "Mammal",
    "habitat": "Found in all oceans, from the frigid Arctic to tropical seas. They are most abundant in cold, coastal waters.",
    "conservation_status": "Data Deficient",
    "status_threats": "Threats include depletion of prey species (like salmon), chemical pollution, and disturbance from vessel traffic and underwater noise.",
    "description": "The largest member of the dolphin family, an apex predator known for its distinctive black-and-white coloring. Orcas are highly intelligent and live in complex social groups.",
    "food": "Carnivore; has a highly varied diet that can include fish, seals, sea lions, dolphins, and even large whales.",
    "region": "All Oceans",
    "image": "images/orca.png"
  },
  {
    "id": 23,
    "name": "Snow Leopard",
    "scientific_name": "Panthera uncia",
    "type": "Mammal",
    "habitat": "High, rugged mountain regions of Central and South Asia, often in steep, rocky terrain above the tree line.",
    "conservation_status": "Vulnerable",
    "status_threats": "Poaching for their fur and body parts, retaliatory killings by farmers to protect livestock, habitat degradation, and a decline in their natural prey.",
    "description": "A large, elusive cat known for its beautiful, thick, smoky-gray coat with dark rosettes. It has a very long tail that aids in balance and can be wrapped around its body for warmth.",
    "food": "Carnivore; primarily preys on mountain ungulates like blue sheep (bharal) and ibex.",
    "region": "Central and South Asia",
    "image": "images/snow_leopard.png"
  },
  {
    "id": 24,
    "name": "Golden Eagle",
    "scientific_name": "Aquila chrysaetos",
    "type": "Bird",
    "habitat": "Open and semi-open country with native vegetation, often in mountainous areas, canyons, and grasslands across the Northern Hemisphere.",
    "conservation_status": "Least Concern",
    "status_threats": "Faces threats from habitat loss, collisions with wind turbines and power lines, and lead poisoning from ingesting ammunition in carrion.",
    "description": "One of the world's most powerful birds of prey, with dark brown plumage and golden-brown feathers on its head and neck. Renowned for its speed and agility.",
    "food": "Carnivore; hunts a wide range of prey, including rabbits, marmots, ground squirrels, and sometimes larger animals like foxes or young deer.",
    "region": "Northern Hemisphere",
    "image": "images/golden_eagle.png"
  },
  {
    "id": 25,
    "name": "Poison Dart Frog",
    "scientific_name": "Dendrobatidae (family)",
    "type": "Amphibian",
    "habitat": "Humid, tropical rainforests of Central and South America, typically found on the forest floor or in low-lying vegetation.",
    "conservation_status": "Varies by species (from Least Concern to Critically Endangered)",
    "status_threats": "Deforestation for agriculture and logging, pollution, the illegal pet trade, and the infectious disease chytridiomycosis.",
    "description": "A family of frogs famous for their vibrant colors, which serve as a warning to predators that their skin is highly toxic.",
    "food": "Insectivore; eats small insects like ants and termites, from which they accumulate the toxins that make them poisonous.",
    "region": "Central and South America",
    "image": "images/poison_dart_frog.png"
  },
  {
    "id": 26,
    "name": "Red Kangaroo",
    "scientific_name": "Osphranter rufus",
    "type": "Mammal",
    "habitat": "Arid and semi-arid grasslands, savannas, and shrublands that cover much of mainland Australia.",
    "conservation_status": "Least Concern",
    "status_threats": "Drought is a major natural threat that can significantly impact populations. They are also sometimes culled when their numbers conflict with agriculture.",
    "description": "The largest living marsupial, famous for its powerful hind legs used for hopping at high speeds. Females have a pouch (marsupium) to carry their young.",
    "food": "Herbivore; grazes mainly on grasses and other low-lying vegetation, and can survive for long periods without drinking water.",
    "region": "Australia",
    "image": "images/red_kangaroo.png"
  },
  {
    "id": 27,
    "name": "Clownfish",
    "scientific_name": "Amphiprioninae (subfamily)",
    "type": "Fish",
    "habitat": "Warm, shallow waters of the Indian and Pacific Oceans, living in a symbiotic relationship with venomous sea anemones on coral reefs.",
    "conservation_status": "Generally Least Concern, but highly vulnerable to coral reef degradation.",
    "status_threats": "The primary threat is the loss of their anemone homes due to coral bleaching caused by climate change, as well as over-collection for the aquarium trade.",
    "description": "Small, brightly colored fish, typically orange with white stripes, known for their unique ability to live unharmed among the stinging tentacles of sea anemones.",
    "food": "Omnivore; eats small invertebrates, algae, and food scraps left over from the anemone's meals.",
    "region": "Indian and Pacific Oceans",
    "image": "images/clownfish.png"
  },
  {
    "id": 28,
    "name": "Axolotl",
    "scientific_name": "Ambystoma mexicanum",
    "type": "Amphibian",
    "habitat": "Naturally found only in the lake complex of Xochimilco near Mexico City. They are fully aquatic and do not leave the water.",
    "conservation_status": "Critically Endangered",
    "status_threats": "Severe habitat loss and degradation due to urbanization and water pollution, and the introduction of invasive fish species that prey on them.",
    "description": "A unique species of salamander that remains in its larval form its entire life, retaining its feathery external gills. It is renowned for its extraordinary ability to regenerate lost limbs and even parts of its brain.",
    "food": "Carnivore; eats mollusks, worms, insect larvae, crustaceans, and small fish.",
    "region": "Mexico",
    "image": "images/axolotl.png"
  },
  {
    "id": 29,
    "name": "Giant Oceanic Manta Ray",
    "scientific_name": "Mobula birostris",
    "type": "Fish",
    "habitat": "Tropical, subtropical, and temperate ocean waters worldwide. They are pelagic, meaning they live in the open ocean, but sometimes visit coastal reefs for cleaning.",
    "conservation_status": "Endangered",
    "status_threats": "Targeted fishing for their gill plates, which are used in traditional medicine, and accidental entanglement in fishing gear (bycatch).",
    "description": "The world's largest ray, with enormous triangular pectoral fins that resemble wings. They are intelligent, filter-feeding giants known for their graceful swimming and occasional acrobatic leaps from the water.",
    "food": "Zooplanktonivore; they filter vast amounts of water to consume tiny organisms like krill, plankton, and small fish.",
    "region": "Worldwide tropical and temperate waters",
    "image": "images/manta_ray.png"
  },
  {
    "id": 30,
    "name": "Bornean Orangutan",
    "scientific_name": "Pongo pygmaeus",
    "type": "Mammal",
    "habitat": "Lowland and tropical rainforests on the island of Borneo. As the world's largest tree-dwelling animal, they spend over 90% of their lives in the forest canopy.",
    "conservation_status": "Critically Endangered",
    "status_threats": "The most significant threat is rapid habitat loss due to deforestation for palm oil plantations and logging. Illegal hunting and the pet trade also pose serious risks.",
    "description": "A large great ape with distinctive long, reddish-brown hair. Known for their intelligence and solitary nature, mature males develop large cheek pads called flanges.",
    "food": "Frugivore; their diet consists of over 400 types of food, primarily wild fruits, but also leaves, bark, insects, and occasionally bird eggs.",
    "region": "Borneo (Southeast Asia)",
    "image": "images/bornean_orangutan.png"
  },
  {
    "id": 31,
    "name": "Ruby-throated Hummingbird",
    "scientific_name": "Archilochus colubris",
    "type": "Bird",
    "habitat": "Open woodlands, forests, gardens, and parks. They breed in eastern North America and migrate to Central America for the winter.",
    "conservation_status": "Least Concern",
    "status_threats": "While populations are stable, they face threats from habitat loss in their wintering grounds, window collisions, and pesticides.",
    "description": "A tiny, brilliantly colored bird known for its ability to hover in mid-air by rapidly flapping its wings (50+ times per second). Males have a vibrant, iridescent red throat.",
    "food": "Nectarivore; feeds on nectar from flowers using a long, extendable tongue. They also catch small insects and spiders for protein.",
    "region": "North and Central America",
    "image": "images/ruby_throated_hummingbird.png"
  },
  {
    "id": 32,
    "name": "Walrus",
    "scientific_name": "Odobenus rosmarus",
    "type": "Mammal",
    "habitat": "Shallow arctic waters and sea ice in the Arctic Ocean and subarctic seas. They rely on sea ice for resting, giving birth, and nursing their young.",
    "conservation_status": "Vulnerable",
    "status_threats": "The primary threat is the loss of sea ice due to climate change, forcing them to congregate on land in massive, sometimes dangerous, haul-outs. Ocean noise and industrial activity are also concerns.",
    "description": "A large marine mammal easily recognized by its long tusks (found on both sexes), prominent whiskers, and massive, blubbery body. They are highly social animals.",
    "food": "Carnivore; forages on the sea floor, using its sensitive whiskers to find bivalve mollusks like clams, as well as worms, snails, and other invertebrates.",
    "region": "Arctic Circle",
    "image": "images/walrus.png"
  },
  {
    "id": 33,
    "name": "Fennec Fox",
    "scientific_name": "Vulpes zerda",
    "type": "Mammal",
    "habitat": "Deserts and arid regions of North Africa, particularly the Sahara. They live in extensive underground dens or burrows to escape the daytime heat.",
    "conservation_status": "Least Concern",
    "status_threats": "While widespread, they are threatened in some areas by trapping for the illegal pet trade and habitat degradation from increasing human settlement.",
    "description": "The smallest species of canid in the world, famous for its oversized ears which can be up to 6 inches long. These ears help to dissipate body heat and locate prey moving underground.",
    "food": "Omnivore; being nocturnal hunters, they prey on insects, rodents, lizards, and birds, and supplement their diet with roots and fruits.",
    "region": "North Africa",
    "image": "images/fennec_fox.png"
  },
  {
    "id": 34,
    "name": "Common Seahorse",
    "scientific_name": "Hippocampus hippocampus",
    "type": "Fish",
    "habitat": "Shallow tropical and temperate coastal waters, living in sheltered areas like seagrass beds, coral reefs, and mangroves where they can grip onto vegetation with their tails.",
    "conservation_status": "Data Deficient",
    "status_threats": "Major threats include the destruction of their habitats (seagrass beds and coral reefs), overfishing for traditional medicine and the aquarium trade, and being caught as bycatch.",
    "description": "A small, unique fish with a horse-like head, an upright posture, and a prehensile tail. Uniquely in the animal kingdom, the male carries the developing eggs in a brood pouch and gives birth to live young.",
    "food": "Carnivore; it is an ambush predator that eats small crustaceans, shrimp, and plankton, which it sucks in through its tube-like snout.",
    "region": "Worldwide coastal waters",
    "image": "images/common_seahorse.png"
  },
  {
    "id": 35,
    "name": "Southern Cassowary",
    "scientific_name": "Casuarius casuarius",
    "type": "Bird",
    "habitat": "Tropical rainforests of northeastern Australia, New Guinea, and nearby islands. They are solitary birds that roam the forest floor.",
    "conservation_status": "Least Concern",
    "status_threats": "The Australian population is considered endangered due to severe habitat loss and fragmentation, vehicle strikes on roads, and attacks by domestic dogs.",
    "description": "A large, flightless bird with glossy black plumage, a vibrant blue neck, and a bony helmet-like structure called a casque on its head. It is often considered the world's most dangerous bird due to its powerful legs and 5-inch, dagger-like claw on each foot.",
    "food": "Frugivore; its diet primarily consists of fallen fruit from the rainforest floor. It plays a crucial role as a keystone species by dispersing seeds over long distances.",
    "region": "Australia and New Guinea",
    "image": "images/southern_cassowary.png"
  },
  {
    "id": 36,
    "name": "Sea Otter",
    "scientific_name": "Enhydra lutris",
    "type": "Mammal",
    "habitat": "Coastal kelp forests and estuaries in the northern Pacific Ocean. They rarely venture far from shore.",
    "conservation_status": "Endangered",
    "status_threats": "Historically decimated by the fur trade, current threats include oil spills (which destroy their fur's insulating properties), entanglement in fishing nets, predation by orcas, and diseases.",
    "description": "The smallest marine mammal in North America, known for having the densest fur in the animal kingdom. They are a keystone species and are famous for using rocks as tools to crack open shellfish while floating on their backs.",
    "food": "Carnivore; eats a variety of marine invertebrates such as sea urchins, crabs, clams, mussels, and snails, which they forage from the sea floor.",
    "region": "North Pacific Ocean",
    "image": "images/sea_otter.png"
  },
  {
    "id": 37,
    "name": "Domestic Dog",
    "scientific_name": "Canis lupus familiaris",
    "type": "Mammal",
    "habitat": "Lives in human households and settlements worldwide. Highly adaptable to various climates, from urban apartments to rural farms.",
    "conservation_status": "Domesticated",
    "status_threats": "Threats for domestic dogs include neglect, abuse, and overpopulation leading to stray animals. Breed-specific genetic health issues are also a concern.",
    "description": "A domesticated carnivorous mammal that has been selectively bred for millennia for various behaviors, sensory capabilities, and physical attributes. Known as 'man's best friend' for its loyalty and companionship.",
    "food": "Omnivore; typically fed commercial dog food, but their diet can include a mix of meat, grains, and vegetables.",
    "region": "Worldwide (in association with humans)",
    "image": "images/domestic_dog.png"
  },
  {
    "id": 38,
    "name": "Domestic Cat",
    "scientific_name": "Felis catus",
    "type": "Mammal",
    "habitat": "Primarily lives inside human homes but also exists in feral colonies in urban, suburban, and rural environments globally.",
    "conservation_status": "Domesticated",
    "status_threats": "Similar to dogs, threats include overpopulation, neglect, and disease. Feral cats are also recognized as a significant threat to native bird and small mammal populations.",
    "description": "A small carnivorous mammal that is one of the most popular pets in the world. Known for its agility, independence, cleanliness, and natural hunting instincts.",
    "food": "Obligate Carnivore; requires a diet of meat for survival. Typically eats commercial cat food, but feral cats hunt small rodents, birds, and insects.",
    "region": "Worldwide (in association with humans)",
    "image": "images/domestic_cat.png"
  },
  {
    "id": 39,
    "name": "House Sparrow",
    "scientific_name": "Passer domesticus",
    "type": "Bird",
    "habitat": "Strongly associated with human habitation. Found in urban centers, suburban neighborhoods, and agricultural areas. Avoids extensive woodlands, forests, and deserts.",
    "conservation_status": "Least Concern",
    "status_threats": "While globally abundant, some regional populations, particularly in Western Europe, have seen sharp declines due to agricultural intensification and loss of nesting sites.",
    "description": "A small, stocky, and social bird with a stout bill. Males have a grey crown and a distinctive black bib, while females are a plain brownish-grey. Known for its persistent and cheerful chirping.",
    "food": "Omnivore; primarily eats grains and seeds from crops and weeds, but also consumes insects (especially to feed its young) and food scraps discarded by humans.",
    "region": "Worldwide (originally from Eurasia and North Africa)",
    "image": "images/house_sparrow.png"
  },
  {
    "id": 40,
    "name": "Indian Peafowl",
    "scientific_name": "Pavo cristatus",
    "type": "Bird",
    "habitat": "Native to the Indian subcontinent, it inhabits open woodlands, forests, and farmland. It has adapted well to live near human settlements and agricultural lands.",
    "conservation_status": "Least Concern",
    "status_threats": "Locally threatened by poaching for their vibrant feathers and meat, as well as habitat destruction and pesticide poisoning.",
    "description": "A large, colorful bird of the pheasant family, and the national bird of India. The male, known as a peacock, is famous for its massive, iridescent tail covert feathers, which it fans out in a spectacular display to attract a mate. The female is called a peahen.",
    "food": "Omnivore; forages on the ground for seeds, grains, fruits, insects, and small vertebrates like lizards and snakes.",
    "region": "Indian Subcontinent (widely introduced elsewhere)",
    "image": "images/indian_peafowl.png"
  },
  {
    "id": 41,
    "name": "Pigeon",
    "scientific_name": "Columba livia",
    "type": "Bird",
    "habitat": "Its native habitat is on sea cliffs and mountains, but it has successfully adapted to human-made structures, making it a ubiquitous sight in cities and towns worldwide.",
    "conservation_status": "Least Concern",
    "status_threats": "There are no major threats to its population, which is abundant globally. In many cities, it is considered a pest and may be subject to control measures.",
    "description": "A stout-bodied bird with a short neck and a slender bill. Feral pigeons come in a wide variety of colors, from the ancestral blue-grey with iridescent neck feathers to white, brown, and mottled patterns.",
    "food": "Granivore; its natural diet consists of seeds and grains, but in urban environments, it readily consumes discarded human food such as bread, popcorn, and fries.",
    "region": "Worldwide",
    "image": "images/pigeon.png"
  },
  {
    "id": 42,
    "name": "Horse",
    "scientific_name": "Equus caballus",
    "type": "Mammal",
    "habitat": "Found in domesticated settings worldwide, from open pastures and ranches to stables. They are adapted to a variety of climates.",
    "conservation_status": "Domesticated",
    "status_threats": "Threats to domestic horses include neglect and abandonment. Feral horse populations can face challenges from habitat loss and are sometimes managed as invasive species.",
    "description": "A large herbivorous mammal domesticated for transportation, agricultural work, and sport. Known for its speed, strength, and strong social bonds within a herd.",
    "food": "Herbivore; primarily grazes on grass but is also fed hay, oats, and other grains in domestic settings.",
    "region": "Worldwide",
    "image": "images/horse.png"
  },
  {
    "id": 43,
    "name": "Goldfish",
    "scientific_name": "Carassius auratus",
    "type": "Fish",
    "habitat": "Originally a freshwater fish from East Asia. Domesticated varieties are kept in aquariums and ponds globally. Feral populations can establish in slow-moving bodies of water.",
    "conservation_status": "Domesticated",
    "status_threats": "In the wild, released goldfish can become an invasive species, harming native ecosystems by outcompeting local fish and stirring up sediment.",
    "description": "One of the earliest fish to be domesticated and one of the most common aquarium fish. Selectively bred into many different colors and shapes, from the common orange variety to more exotic forms like the Fantail and Ryukin.",
    "food": "Omnivore; eats insects, crustaceans, and plant matter. In captivity, they are typically fed flakes or pellets.",
    "region": "Worldwide (in captivity)",
    "image": "images/goldfish.png"
  },
  {
    "id": 44,
    "name": "Asian Elephant",
    "scientific_name": "Elephas maximus",
    "type": "Mammal",
    "habitat": "Inhabits grasslands, tropical evergreen forests, and scrub forests across the Indian subcontinent and Southeast Asia. They require large areas with fresh water.",
    "conservation_status": "Endangered",
    "status_threats": "Severe threats from habitat loss and fragmentation due to agriculture and infrastructure development, which leads to human-elephant conflict. Poaching for ivory tusks remains a danger for males.",
    "description": "Slightly smaller than its African cousin, the Asian elephant is distinguished by its smaller, rounded ears and a twin-domed head. It is a keystone species and holds immense cultural and religious significance in Asia.",
    "food": "Herbivore; a mega-grazer that feeds on a wide variety of plants, including grasses, tree bark, roots, leaves, and fruits.",
    "region": "Indian Subcontinent and Southeast Asia",
    "image": "images/asian_elephant.png"
  },
  {
    "id": 45,
    "name": "Rhesus Macaque",
    "scientific_name": "Macaca mulatta",
    "type": "Mammal",
    "habitat": "Extremely adaptable, found in a vast range of habitats from arid plains to dense forests, and is very common in urban environments, temples, and villages across Asia.",
    "conservation_status": "Least Concern",
    "status_threats": "While globally abundant, they are often considered pests in urban and agricultural areas, leading to human-macaque conflict and persecution.",
    "description": "A medium-sized monkey with a pinkish, hairless face and a brownish-grey coat. They are highly intelligent, live in large and complex social troops, and are known for their assertive nature.",
    "food": "Omnivore; their diet is highly flexible and includes fruits, seeds, roots, and insects, as well as food items scavenged or taken from humans.",
    "region": "Asia",
    "image": "images/rhesus_macaque.png"
  },
  {
    "id": 46,
    "name": "Indian Cobra",
    "scientific_name": "Naja naja",
    "type": "Reptile",
    "habitat": "Found in a variety of habitats across the Indian subcontinent, including dense forests, open fields, agricultural lands (rice paddies), and even heavily populated urban areas.",
    "conservation_status": "Least Concern",
    "status_threats": "Threatened by persecution from humans due to fear of its venomous bite, road kills, and habitat degradation. It is also illegally hunted for its skin and venom.",
    "description": "A highly venomous snake, famous for the large hood it spreads when threatened, which often displays a distinctive spectacle-like pattern. It is one of the 'Big Four' snakes responsible for the majority of snakebite fatalities in India.",
    "food": "Carnivore; it actively hunts rodents (making it beneficial to farmers), lizards, frogs, and occasionally other snakes.",
    "region": "Indian Subcontinent",
    "image": "images/indian_cobra.png"
  },
  {
    "id": 47,
    "name": "Myna",
    "scientific_name": "Acridotheres tristis",
    "type": "Bird",
    "habitat": "Native to Asia, it is an open woodland bird that has adapted extremely well to urban and suburban environments. It thrives in cities and agricultural areas.",
    "conservation_status": "Least Concern",
    "status_threats": "No significant threats; its population is increasing. It is considered an invasive species in many parts of the world, where it outcompetes native birds.",
    "description": "A stocky brown bird with a black head, a bright yellow bill, legs, and bare eye skin. Known for its confident, strutting walk and a wide range of loud calls and whistles.",
    "food": "Omnivore; forages on the ground for insects, fruits, seeds, and discarded waste from human habitation.",
    "region": "Asia (native), introduced worldwide",
    "image": "images/myna.png"
  },
  {
    "id": 48,
    "name": "Gharial",
    "scientific_name": "Gavialis gangeticus",
    "type": "Reptile",
    "habitat": "Lives in clear, fast-flowing river systems. They spend most of their time in the water, coming onto sandy riverbanks to bask and nest.",
    "conservation_status": "Critically Endangered",
    "status_threats": "Severely threatened by river pollution, dam construction, illegal sand mining that destroys their nesting sites, and entanglement in fishing nets.",
    "description": "A unique, fish-eating crocodile distinguished by its very long, thin snout, which is lined with sharp, interlocking teeth. Males develop a bulbous growth on the tip of their snout, resembling a pot (ghara).",
    "food": "Piscivore; its diet consists almost exclusively of fish, which it catches with a swift sideways snap of its specialized snout.",
    "region": "Indian Subcontinent",
    "image": "images/gharial.png"
  },
  {
    "id": 49,
    "name": "American Bison",
    "scientific_name": "Bison bison",
    "type": "Mammal",
    "habitat": "Native to the open grasslands and prairies of North America. Today, they are found in a few national parks and reserves.",
    "conservation_status": "Near Threatened",
    "status_threats": "Historically hunted to near extinction. Current threats include a limited genetic pool, habitat loss, and diseases transmitted from cattle.",
    "description": "The largest mammal in North America, characterized by its shaggy, dark brown coat, a massive head, and a large shoulder hump. They are powerful and social animals that live in herds.",
    "food": "Herbivore; primarily grazes on the grasses and sedges of the prairie.",
    "region": "North America",
    "image": "images/american_bison.png"
  },
  {
    "id": 50,
    "name": "Arctic Fox",
    "scientific_name": "Vulpes lagopus",
    "type": "Mammal",
    "habitat": "Arctic and alpine tundra biomes across the Northern Hemisphere. They live in complex underground burrows to shelter from the extreme cold.",
    "conservation_status": "Least Concern",
    "status_threats": "The primary threat is climate change, which reduces sea ice (impacting food access) and allows the larger red fox to expand northwards, outcompeting them for resources.",
    "description": "A small fox known for its thick, warm fur that acts as camouflage, turning pure white in winter and brownish-grey in summer. It has a short muzzle and rounded ears to minimize heat loss.",
    "food": "Omnivore; preys on lemmings, voles, birds, and eggs. It is also an expert scavenger, following polar bears to feed on the remains of their kills.",
    "region": "Arctic Circle (North America, Europe, Asia)",
    "image": "images/arctic_fox.png"
  },
  {
    "id": 51,
    "name": "Wombat",
    "scientific_name": "Vombatus ursinus",
    "type": "Mammal",
    "habitat": "Forests, woodlands, and coastal heathlands in southeastern Australia and Tasmania. They are powerful burrowers, creating extensive tunnel systems.",
    "conservation_status": "Least Concern",
    "status_threats": "Threatened by habitat loss for agriculture, vehicle collisions on roads, and sarcoptic mange, a parasitic disease that can be fatal.",
    "description": "A stocky, muscular marsupial with short legs and a bear-like appearance. Wombats are nocturnal and are famous for producing distinctive cube-shaped feces.",
    "food": "Herbivore; grazes on native grasses, sedges, and roots. Their continuously growing incisor teeth are well-suited for chewing tough vegetation.",
    "region": "Australia",
    "image": "images/wombat.png"
  },
  {
    "id": 52,
    "name": "Moose",
    "scientific_name": "Alces alces",
    "type": "Mammal",
    "habitat": "Boreal and mixed deciduous forests in the Northern Hemisphere, often found in areas with lakes, ponds, or swamps.",
    "conservation_status": "Least Concern",
    "status_threats": "Threats include habitat degradation, predation, and health issues exacerbated by climate change, such as brain worm and infestations of winter ticks.",
    "description": "The largest and heaviest species in the deer family, distinguished by the massive, flat antlers (palmate antlers) on the males. They have a long face, a drooping snout, and a flap of skin called a dewlap under the throat.",
    "food": "Herbivore; browses on leaves, bark, and twigs from trees like willow and birch. They also feed on aquatic plants by wading into water.",
    "region": "Northern Hemisphere (North America, Europe, Asia)",
    "image": "images/moose.png"
  },
  {
    "id": 53,
    "name": "Toco Toucan",
    "scientific_name": "Ramphastos toco",
    "type": "Bird",
    "habitat": "Tropical and subtropical forests, savannas, and shrublands of South America. They are commonly found in the forest canopy but also adapt to human-modified habitats like plantations.",
    "conservation_status": "Least Concern",
    "status_threats": "Currently faces low risk, but local populations are threatened by habitat loss and illegal capture for the international pet trade.",
    "description": "The largest and most iconic toucan species, famous for its enormous, vibrant orange and black bill. The bill, while looking heavy, is surprisingly lightweight as it is mostly hollow.",
    "food": "Frugivore; their diet is primarily fruit, but they will opportunistically eat insects, eggs, and small lizards.",
    "region": "South America",
    "image": "images/toco_toucan.png"
  },
  {
    "id": 54,
    "name": "Meerkat",
    "scientific_name": "Suricata suricatta",
    "type": "Mammal",
    "habitat": "Arid, open country, savannas, and grasslands of southern Africa. They live in large, complex underground burrow networks known as 'mobs' or 'gangs'.",
    "conservation_status": "Least Concern",
    "status_threats": "There are no major widespread threats to the species, although they are susceptible to droughts that can reduce their food supply and lead to local population declines.",
    "description": "A small, social mongoose known for its cooperative behavior and upright posture. They exhibit 'sentinel duty', where one member stands guard on its hind legs to watch for predators while the others forage.",
    "food": "Insectivore; their diet primarily consists of insects like beetles and caterpillars, but they also eat spiders, scorpions, lizards, and small snakes.",
    "region": "Southern Africa",
    "image": "images/meerkat.png"
  },
  {
    "id": 55,
    "name": "Cheetah",
    "scientific_name": "Acinonyx jubatus",
    "type": "Mammal",
    "habitat": "Open grasslands, savannas, and arid regions of Africa and a small, critically endangered population in Iran.",
    "conservation_status": "Vulnerable",
    "status_threats": "Major threats include habitat loss and fragmentation, human-wildlife conflict with livestock farmers, decline in prey, and a high mortality rate for cubs due to predation by lions and hyenas.",
    "description": "The fastest land animal on Earth, built for speed with a slender body, long legs, and a flexible spine. It is known for its distinctive coat covered in solid black spots and black 'tear mark' stripes running from its eyes to its mouth.",
    "food": "Carnivore; it hunts during the day and preys on small to medium-sized antelopes like gazelles and impalas, as well as hares and the young of larger animals.",
    "region": "Africa and Iran",
    "image": "images/cheetah.png"
  },
  {
    "id": 56,
    "name": "Sloth (Three-toed)",
    "scientific_name": "Bradypus",
    "type": "Mammal",
    "habitat": "Tropical rainforest canopies in Central and South America. They spend nearly their entire lives hanging upside down from tree branches.",
    "conservation_status": "Varies by species (Least Concern to Critically Endangered)",
    "status_threats": "Deforestation for agriculture and logging is the primary threat, destroying their forest canopy homes and fragmenting their populations.",
    "description": "An arboreal mammal famous for its extreme slowness of movement. Its fur often has a greenish tinge due to symbiotic algae growing on it, which provides camouflage.",
    "food": "Herbivore; has a low-energy diet consisting mainly of leaves, which are difficult to digest.",
    "region": "Central and South America",
    "image": "images/sloth.png"
  },
  {
    "id": 57,
    "name": "Indian Leopard",
    "scientific_name": "Panthera pardus fusca",
    "type": "Mammal",
    "habitat": "Extremely adaptable, found in a wide range of habitats from dense rainforests and scrublands to the outskirts of major cities like Mumbai and Pune.",
    "conservation_status": "Vulnerable",
    "status_threats": "Key threats include human-wildlife conflict over livestock, habitat loss and fragmentation, poaching for skin and body parts, and a decline in their natural prey.",
    "description": "A large, elusive cat known for its rosette-patterned coat that provides excellent camouflage. They are powerful, agile climbers, often hoisting their kills into trees to protect them from scavengers.",
    "food": "Carnivore; has a very broad diet including deer, monkeys, wild boar, and domestic animals like dogs and goats, making them highly adaptable.",
    "region": "Indian Subcontinent",
    "image": "images/indian_leopard.png"
  },
  {
    "id": 58,
    "name": "Gaur (Indian Bison)",
    "scientific_name": "Bos gaurus",
    "type": "Mammal",
    "habitat": "Evergreen and deciduous forests and hilly terrains, particularly in the Western Ghats (near Pune), Central India, and Northeast India.",
    "conservation_status": "Vulnerable",
    "status_threats": "Threatened by habitat loss and fragmentation, the spread of diseases from domestic cattle (like foot-and-mouth disease), and poaching for meat and trophies.",
    "description": "The largest and most powerful of all wild cattle, with a massive head, a high convex ridge on its forehead, and a muscular body. Adult males have a characteristic dark black coat and are formidable in size.",
    "food": "Herbivore; grazes and browses on a wide variety of plants, with a preference for fresh grasses, young shoots, and fruits.",
    "region": "South and Southeast Asia",
    "image": "images/gaur.png"
  },
  {
    "id": 59,
    "name": "Moon Jellyfish",
    "scientific_name": "Aurelia aurita",
    "type": "Invertebrate",
    "habitat": "Found in oceans worldwide, typically in coastal and temperate waters. They drift with the currents and are common in harbors, marinas, and estuaries.",
    "conservation_status": "Not Evaluated",
    "status_threats": "While not threatened, their populations can 'bloom' in response to changing ocean conditions like pollution and warming waters, sometimes negatively impacting fisheries and industrial water intakes.",
    "description": "A gelatinous marine animal with a translucent, saucer-shaped bell, often with four distinct horseshoe-shaped reproductive organs visible through the top. Its tentacles are short and deliver a very mild sting.",
    "food": "Carnivore; feeds passively on small planktonic organisms like mollusks, crustaceans, and fish eggs that get trapped in the mucus on its bell.",
    "region": "Worldwide Oceans",
    "image": "images/moon_jellyfish.png"
  },
  {
    "id": 60,
    "name": "Plains Zebra",
    "scientific_name": "Equus quagga",
    "type": "Mammal",
    "habitat": "Treeless grasslands and savanna woodlands of eastern and southern Africa. They are a migratory species, constantly moving to find fresh grass and water.",
    "conservation_status": "Near Threatened",
    "status_threats": "Populations are declining due to habitat loss from farming and ranching, competition for water with livestock, and hunting for their skins and meat.",
    "description": "An iconic African equine famous for its distinctive black and white striped coat. It is believed the stripes serve to confuse predators, repel insects, and aid in social bonding, as each zebra's pattern is unique.",
    "food": "Herbivore; primarily a grazer, its diet consists of over 90% grass, but it will also eat leaves and stems when grass is scarce.",
    "region": "Africa",
    "image": "images/zebra.png"
  },
  {
    "id": 61,
    "name": "Kingfisher",
    "scientific_name": "Alcedo atthis",
    "type": "Bird",
    "habitat": "Clear, slow-moving rivers, streams, lakes, and ponds across Eurasia and North Africa. They require suitable vertical banks for digging their nesting burrows.",
    "conservation_status": "Least Concern",
    "status_threats": "Locally vulnerable to water pollution which reduces their fish supply, and habitat disturbance from river engineering and human activity.",
    "description": "A small, unmistakable bird with iridescent blue upperparts, a vibrant orange breast, and a long, dagger-like bill. Known for perching on branches over water and making spectacular, high-speed dives to catch fish.",
    "food": "Piscivore; its diet consists mainly of small fish like minnows and sticklebacks, but also aquatic insects and freshwater shrimps.",
    "region": "Europe, Asia, North Africa",
    "image": "images/kingfisher.png"
  },
  {
    "id": 62,
    "name": "Hippopotamus",
    "scientific_name": "Hippopotamus amphibius",
    "type": "Mammal",
    "habitat": "Rivers, lakes, and mangrove swamps in sub-Saharan Africa. They require water deep enough to submerge in during the day to keep their skin cool and moist.",
    "conservation_status": "Vulnerable",
    "status_threats": "Threatened by habitat loss as human populations expand along rivers, as well as illegal and unregulated hunting for their meat and ivory canine teeth.",
    "description": "A large, semi-aquatic mammal with a barrel-shaped body, short, stumpy legs, and a massive head. Despite its stocky shape and placid appearance, it is one of the most dangerous and aggressive animals in Africa.",
    "food": "Herbivore; emerges from the water at night to graze on short grasses, often traveling several kilometers from the water to feed.",
    "region": "Africa",
    "image": "images/hippopotamus.png"
  },
  {
    "id": 63,
    "name": "Indian Rhinoceros",
    "scientific_name": "Rhinoceros unicornis",
    "type": "Mammal",
    "habitat": "Tall grasslands and forests in the foothills of the Himalayas. They are semi-aquatic and often found in swamps, marshes, and riverine areas.",
    "conservation_status": "Vulnerable",
    "status_threats": "The primary threat is poaching for their single horn, which is highly valued in some cultures. Habitat loss due to human encroachment is also a significant concern.",
    "description": "A large, grey-brown mammal with thick, armour-like skin folds and a single black horn on its snout. Unlike African rhinos, they have a prehensile upper lip for grasping vegetation.",
    "food": "Herbivore; primarily a grazer, its diet consists of tall grasses, but it also eats leaves, branches of shrubs, and aquatic plants.",
    "region": "Indian Subcontinent (primarily India and Nepal)",
    "image": "images/indian_rhino.png"
  },
  {
    "id": 64,
    "name": "Sloth Bear",
    "scientific_name": "Melursus ursinus",
    "type": "Mammal",
    "habitat": "A variety of dry and moist forests and grasslands across the Indian subcontinent, favoring areas with rock outcroppings for denning.",
    "conservation_status": "Vulnerable",
    "status_threats": "The primary threats are habitat loss and degradation, as well as human-bear conflict, which is common as their habitats often overlap with human settlements.",
    "description": "A nocturnal bear with long, shaggy black fur, a distinctive pale, V-shaped mark on its chest, and a long muzzle. They have uniquely adapted lips and a gap in their front teeth for sucking termites and ants from mounds.",
    "food": "Myrmecophagous (insectivore); its diet consists mainly of termites and ants, supplemented with fruits, honey, and flowers.",
    "region": "Indian Subcontinent",
    "image": "images/sloth_bear.png"
  },
  {
    "id": 65,
    "name": "Capybara",
    "scientific_name": "Hydrochoerus hydrochaeris",
    "type": "Mammal",
    "habitat": "Dense forests near bodies of water, such as lakes, rivers, swamps, and marshes throughout most of South America.",
    "conservation_status": "Least Concern",
    "status_threats": "While widespread, they are hunted for their meat and hide. Habitat loss due to deforestation and agriculture is a threat in some regions.",
    "description": "The largest rodent in the world, with a heavy, barrel-shaped body, a short head, and webbed feet. They are semi-aquatic and are renowned for their calm and highly social nature, often seen resting with other animals.",
    "food": "Herbivore; grazes on grasses and aquatic plants, and is very selective, feeding on the leaves of only a few plant species.",
    "region": "South America",
    "image": "images/capybara.png"
  },
  {
    "id": 66,
    "name": "Saltwater Crocodile",
    "scientific_name": "Crocodylus porosus",
    "type": "Reptile",
    "habitat": "Primarily brackish and saltwater habitats such as mangrove swamps, estuaries, and river deltas. They can travel long distances in the open ocean.",
    "conservation_status": "Least Concern",
    "status_threats": "Historically overhunted for their skin. Current threats include habitat destruction of mangrove forests and human-crocodile conflict as they are a danger to humans and livestock.",
    "description": "The largest living reptile in the world, and a formidable apex predator. They have a broad snout and are known for their immense size, power, and territorial aggression.",
    "food": "Carnivore; a hypercarnivore that preys on a vast range of animals, including fish, birds, and any mammal that ventures too close to the water, such as deer, wild boar, and buffalo.",
    "region": "Southeast Asia, Northern Australia, and Eastern India",
    "image": "images/saltwater_crocodile.png"
  },
  {
    "id": 67,
    "name": "Llama",
    "scientific_name": "Lama glama",
    "type": "Mammal",
    "habitat": "Domesticated and found in the high-altitude Altiplano of the Andes Mountains in South America, adapted to harsh, cool, and dry climates.",
    "conservation_status": "Domesticated",
    "status_threats": "As a domesticated species, there are no major threats to their survival, though hybridization with alpacas can be a concern for maintaining purebred lines.",
    "description": "A domesticated South American camelid, widely used as a meat and pack animal by Andean cultures for thousands of years. They are known for their intelligence, social herd behavior, and tendency to spit when agitated.",
    "food": "Herbivore; grazes on a variety of low shrubs, lichens, and other mountain vegetation.",
    "region": "South America (Andes Mountains)",
    "image": "images/llama.png"
  },
  {
    "id": 68,
    "name": "Indian Grey Hornbill",
    "scientific_name": "Ocyceros birostris",
    "type": "Bird",
    "habitat": "Common in urban areas with large trees, gardens, and deciduous forests across the Indian subcontinent. They are frequently seen in cities like Pune and Delhi.",
    "conservation_status": "Least Concern",
    "status_threats": "Threatened primarily by urbanization and the felling of large, mature trees which they require for nesting.",
    "description": "A medium-sized hornbill with grey plumage, a large, dark bill, and a distinctive casque (a helmet-like structure) on top. They have a unique nesting behavior where the female seals herself inside a tree cavity using mud and droppings to raise her chicks.",
    "food": "Frugivore/Omnivore; their diet consists mainly of fruits, especially figs, but they will also opportunistically eat insects, small reptiles, and bird eggs.",
    "region": "Indian Subcontinent",
    "image": "images/indian_grey_hornbill.png"
  },
  {
    "id": 69,
    "name": "Dhole (Asiatic Wild Dog)",
    "scientific_name": "Cuon alpinus",
    "type": "Mammal",
    "habitat": "They occupy a variety of habitats, including dense forests, jungles, and scrublands in South and Southeast Asia.",
    "conservation_status": "Endangered",
    "status_threats": "Major threats include habitat loss, depletion of their prey base (like deer), diseases transmitted from domestic dogs, and persecution from humans who view them as competitors for game.",
    "description": "A highly social wild dog that lives and hunts in large packs. They have a reddish-brown coat, a bushy black tail, and a complex vocal system that includes whistles, clicks, and screams to coordinate attacks.",
    "food": "Carnivore; they are formidable pack hunters, preying on medium to large-sized deer, wild boar, and sometimes even larger animals like gaur.",
    "region": "South and Southeast Asia",
    "image": "images/dhole.png"
  },
  {
    "id": 70,
    "name": "Blackbuck",
    "scientific_name": "Antilope cervicapra",
    "type": "Mammal",
    "habitat": "Grasslands and lightly forested areas of the Indian subcontinent. They prefer open plains where their speed can be used to evade predators.",
    "conservation_status": "Least Concern",
    "status_threats": "Historically threatened by excessive hunting and habitat loss. Today, major threats include habitat fragmentation, predation by feral dogs, and agricultural expansion.",
    "description": "An antelope known for the striking, long, spiral horns of the males, who also possess a distinctive black to dark brown coat. They are among the fastest land animals, capable of reaching speeds up to 80 km/h (50 mph).",
    "food": "Herbivore; primarily a grazer that feeds on a variety of short grasses, but also browses on leaves and fruits.",
    "region": "Indian Subcontinent",
    "image": "images/blackbuck.png"
  },
  {
    "id": 71,
    "name": "Ring-tailed Lemur",
    "scientific_name": "Lemur catta",
    "type": "Mammal",
    "habitat": "Gallery forests and spiny scrublands in the southern regions of Madagascar. They are the most terrestrial of all lemurs, spending significant time on the ground.",
    "conservation_status": "Endangered",
    "status_threats": "Major threats include habitat destruction from slash-and-burn agriculture and charcoal production. They are also hunted for bushmeat and captured for the illegal pet trade.",
    "description": "An iconic primate easily recognized by its long, bushy tail with 13 alternating black and white rings. They are highly social and are known for their 'sun-worshipping' posture, where they sit upright facing the sun.",
    "food": "Omnivore; their diet is primarily fruit and leaves (especially from the tamarind tree), but they also consume flowers, insects, and tree sap.",
    "region": "Madagascar",
    "image": "images/ring_tailed_lemur.png"
  },
  {
    "id": 72,
    "name": "Octopus",
    "scientific_name": "Octopus vulgaris",
    "type": "Invertebrate (Mollusc)",
    "habitat": "Found in tropical, subtropical, and temperate waters worldwide. They live in coastal areas on the sea floor, often creating dens within rocks, litter, or coral reefs.",
    "conservation_status": "Not Evaluated",
    "status_threats": "Overfishing is a major concern in many regions as they are a popular food source. They are also sensitive to water pollution and the degradation of their coastal reef habitats.",
    "description": "A highly intelligent marine mollusc with a soft body, eight flexible arms lined with suckers, and the ability to instantly change its skin color and texture for camouflage or communication. They can also squirt ink to deter predators.",
    "food": "Carnivore; a skilled predator that hunts for crabs, crayfish, and other molluscs at night, using its hard beak to break open their shells.",
    "region": "Worldwide Oceans",
    "image": "images/octopus.png"
  },
  {
    "id": 73,
    "name": "Lion-tailed Macaque",
    "scientific_name": "Macaca silenus",
    "type": "Mammal",
    "habitat": "Tropical evergreen rainforests of the Western Ghats in Southwestern India (near Maharashtra, Karnataka, Kerala, Tamil Nadu). They are arboreal, spending most of their lives in the upper canopy.",
    "conservation_status": "Endangered",
    "status_threats": "Severe habitat fragmentation due to the spread of agriculture and the construction of dams and reservoirs. They are shy and avoid humans, making them unable to adapt to human-altered landscapes.",
    "description": "A medium-sized monkey with a striking appearance: a mane of silvery-white hair surrounding its black face, and a long, thin tail with a tuft at the end, resembling a lion's tail.",
    "food": "Omnivore; primarily a frugivore (fruit-eater), but their diet also includes leaves, buds, insects, and small vertebrates.",
    "region": "India (Western Ghats)",
    "image": "images/lion_tailed_macaque.png"
  },
  {
    "id": 74,
    "name": "Dromedary Camel",
    "scientific_name": "Camelus dromedarius",
    "type": "Mammal",
    "habitat": "Domesticated and found in arid and desert regions of the Middle East, North Africa, and the Horn of Africa. Large feral populations exist in Australia.",
    "conservation_status": "Domesticated",
    "status_threats": "As a domesticated species, it faces no survival threats. Feral populations in Australia are often culled as they can damage native ecosystems.",
    "description": "A large ungulate known as the 'ship of the desert'. It is famous for its single prominent hump, which stores fat that can be metabolized for energy and water. They are superbly adapted to desert life.",
    "food": "Herbivore; a hardy browser that can eat tough, thorny plants, grasses, and shrubs that many other animals cannot digest.",
    "region": "Middle East, North Africa (introduced worldwide)",
    "image": "images/dromedary_camel.png"
  },
  {
    "id": 75,
    "name": "Indian Vulture",
    "scientific_name": "Gyps indicus",
    "type": "Bird",
    "habitat": "Historically found in cities, towns, and open country near human habitation in Central and Peninsular India. They nest on cliffs, ruins, and old buildings.",
    "conservation_status": "Critically Endangered",
    "status_threats": "Suffered a catastrophic population decline (over 97%) caused by kidney failure from feeding on livestock carcasses treated with the veterinary drug diclofenac.",
    "description": "A medium-sized vulture with a bald head, very broad wings, and a bulky, pale body. They are social birds that soar at great heights to scan for carrion and play a vital role as nature's most efficient scavengers.",
    "food": "Scavenger (Carnivore); feeds almost exclusively on the carcasses of dead animals, particularly domestic cattle.",
    "region": "Indian Subcontinent",
    "image": "images/indian_vulture.png"
  },
  {
    "id": 76,
    "name": "Monarch Butterfly",
    "scientific_name": "Danaus plexippus",
    "type": "Insect",
    "habitat": "Open fields, meadows, and gardens where milkweed plants are found. They require different habitats for breeding in the summer and overwintering in Mexico and California.",
    "conservation_status": "Endangered",
    "status_threats": "Major threats include habitat loss (particularly of milkweed, the only food source for its larvae), widespread pesticide use, and climate change affecting their migration patterns.",
    "description": "An iconic butterfly known for its striking orange and black pattern and its incredible, multi-generational annual migration across North America. Its bright colors warn predators of its toxicity.",
    "food": "Larvae (caterpillars) feed exclusively on milkweed plants. Adult butterflies feed on nectar from a variety of flowering plants.",
    "region": "North and South America",
    "image": "images/monarch_butterfly.png"
  },
  {
    "id": 77,
    "name": "Bottlenose Dolphin",
    "scientific_name": "Tursiops truncatus",
    "type": "Mammal",
    "habitat": "Warm and temperate seas worldwide. They can be found in a variety of marine habitats, from shallow coastal bays and estuaries to the deep waters of the open ocean.",
    "conservation_status": "Least Concern",
    "status_threats": "Threats include entanglement in fishing gear (bycatch), chemical and noise pollution from human activities, habitat degradation, and direct hunting in some parts of the world.",
    "description": "A highly intelligent and social marine mammal renowned for its playful behavior, acrobatic leaps, and characteristic 'smile'. They use a sophisticated system of clicks and whistles to communicate and echolocation to navigate and hunt.",
    "food": "Carnivore; they have a varied diet of fish, squid, and crustaceans, which they often hunt cooperatively in groups called pods.",
    "region": "Worldwide Oceans",
    "image": "images/bottlenose_dolphin.png"
  },
  {
    "id": 78,
    "name": "Indian Giant Squirrel",
    "scientific_name": "Ratufa indica",
    "type": "Mammal",
    "habitat": "Tropical and subtropical evergreen and moist deciduous forests of the Indian peninsula, particularly in the Western Ghats mountain range. They are almost exclusively arboreal.",
    "conservation_status": "Least Concern",
    "status_threats": "The primary threat is habitat loss and fragmentation from deforestation. They are also hunted for fur and meat in some local areas.",
    "description": "One of the largest squirrel species in the world, with a striking multi-colored coat of beige, tan, and dark brown or maroon. It has a very long, bushy tail for balance and is the state animal of Maharashtra, India.",
    "food": "Omnivore; primarily eats fruits, flowers, nuts, and tree bark, but will also consume insects and bird eggs.",
    "region": "India (Peninsular)",
    "image": "images/indian_giant_squirrel.png"
  },
  {
    "id": 79,
    "name": "Veiled Chameleon",
    "scientific_name": "Chamaeleo calyptratus",
    "type": "Reptile",
    "habitat": "Native to the mountainous regions of Yemen and Saudi Arabia. They are arboreal, living in trees and shrubs in coastal mountain slopes, high deserts, and woodlands.",
    "conservation_status": "Least Concern",
    "status_threats": "Wild populations are threatened by habitat loss and the illegal collection of individuals for the international pet trade.",
    "description": "A distinctive lizard famous for its ability to change color for communication and thermoregulation. It has a long, sticky, projectile tongue to catch prey, and eyes that can move independently of each other.",
    "food": "Insectivore; primarily eats a wide variety of insects and other invertebrates, but will also consume plant matter like leaves and flowers, mainly for hydration.",
    "region": "Arabian Peninsula (widely kept as a pet)",
    "image": "images/veiled_chameleon.png"
  },
  {
    "id": 80,
    "name": "Nilgai (Blue Bull)",
    "scientific_name": "Boselaphus tragocamelus",
    "type": "Mammal",
    "habitat": "Arid and semi-arid grasslands, scrublands, and sparsely wooded forests across the Indian subcontinent. They generally avoid dense forests and desert.",
    "conservation_status": "Least Concern",
    "status_threats": "Habitat loss due to agricultural expansion is the primary threat. While protected in many areas due to their religious significance, they are sometimes persecuted as crop pests.",
    "description": "The largest antelope in Asia. Males (Blue Bulls) have a robust, horse-like build with a bluish-grey coat and short, conical horns. Females are smaller and yellowish-brown. They are known for their speed and endurance.",
    "food": "Herbivore; both a grazer and a browser, feeding on a wide variety of grasses, leaves, buds, and fruits depending on the season.",
    "region": "Indian Subcontinent",
    "image": "images/nilgai.png"
  },
  {
    "id": 81,
    "name": "Piranha (Red-bellied)",
    "scientific_name": "Pygocentrus nattereri",
    "type": "Fish",
    "habitat": "Freshwater rivers, lakes, and floodplains in South America, particularly the Amazon River Basin.",
    "conservation_status": "Least Concern",
    "status_threats": "No major threats, they are abundant throughout their range. They are sometimes collected for the aquarium trade.",
    "description": "A species of fish with a notorious, though often exaggerated, reputation for predation. They have powerful jaws lined with a single row of sharp, interlocking teeth and are known to engage in feeding frenzies.",
    "food": "Omnivore; primarily a scavenger, but also preys on fish, insects, and crustaceans. They will also eat fruits and seeds that fall into the water.",
    "region": "South America",
    "image": "images/piranha.png"
  },
  {
    "id": 82,
    "name": "Greater Flamingo",
    "scientific_name": "Phoenicopterus roseus",
    "type": "Bird",
    "habitat": "Shallow coastal lagoons, salt pans, and large inland lakes. They are found in Africa, Southern Europe, and across South and Southwest Asia.",
    "conservation_status": "Least Concern",
    "status_threats": "The primary threats are the destruction and degradation of their wetland habitats, water pollution, and human disturbance at their large nesting colonies.",
    "description": "An unmistakable wading bird known for its long, thin legs, sinuous neck, and vibrant pink plumage, which is derived from pigments in the algae and crustaceans it eats. They have a unique, downward-curved bill for filter-feeding.",
    "food": "Filter feeder; consumes brine shrimp, small insects, mollusks, and microscopic algae by holding its specialized bill upside down in the water to sieve out food.",
    "region": "Africa, Southern Europe, South Asia",
    "image": "images/greater_flamingo.png"
  },
  {
    "id": 83,
    "name": "Humpback Whale",
    "scientific_name": "Megaptera novaeangliae",
    "type": "Mammal",
    "habitat": "Found in oceans worldwide. They undertake massive annual migrations from cold, polar feeding grounds in the summer to warm, tropical breeding grounds in the winter.",
    "conservation_status": "Least Concern",
    "status_threats": "Once decimated by whaling, current threats include entanglement in fishing gear, strikes by ships, and ocean noise pollution that disrupts their communication and navigation.",
    "description": "A large baleen whale famous for its spectacular breaching behavior (leaping out of the water) and the complex, haunting songs sung by males. They are easily identified by their unusually long pectoral fins and knobby head.",
    "food": "Carnivore; filter-feeds on huge volumes of krill and small fish like herring and mackerel, often using a cooperative hunting technique called bubble-net feeding.",
    "region": "Worldwide Oceans",
    "image": "images/humpback_whale.png"
  },
  {
    "id": 84,
    "name": "Striped Hyena",
    "scientific_name": "Hyaena hyaena",
    "type": "Mammal",
    "habitat": "Arid and semi-arid scrublands, grasslands, and open woodlands in Africa, the Middle East, and the Indian subcontinent.",
    "conservation_status": "Near Threatened",
    "status_threats": "Threatened by deliberate and accidental persecution from humans who often mistakenly view them as dangerous livestock killers, as well as vehicle collisions.",
    "description": "A medium-sized carnivore with a distinctive sloping back, a shaggy coat with dark vertical stripes, and a prominent mane of long hair along its back that can be erected when threatened. They are primarily nocturnal and more solitary than their spotted cousins.",
    "food": "Scavenger (Carnivore); primarily a scavenger, using its powerful jaws to crush bone and feed on the carcasses of large animals. They will also hunt small animals and eat fruit.",
    "region": "Africa, Middle East, Indian Subcontinent",
    "image": "images/striped_hyena.png"
  },
  {
    "id": 85,
    "name": "Nine-banded Armadillo",
    "scientific_name": "Dasypus novemcinctus",
    "type": "Mammal",
    "habitat": "Highly adaptable, they are found in a variety of habitats including rainforests, grasslands, and scrublands across North, Central, and South America.",
    "conservation_status": "Least Concern",
    "status_threats": "There are no major threats to this species, and its range has been expanding northward in the United States. They are common victims of vehicle collisions.",
    "description": "A mammal known for its unique leathery shell, which is formed by plates of dermal bone. They have short legs but can move quickly, and are known for their peculiar habit of jumping straight up in the air when startled.",
    "food": "Insectivore; forages by digging and probing the soil with its long snout for insects, grubs, worms, and other invertebrates.",
    "region": "North, Central, and South America",
    "image": "images/nine_banded_armadillo.png"
  },
  {
    "id": 86,
    "name": "Bengal Monitor",
    "scientific_name": "Varanus bengalensis",
    "type": "Reptile",
    "habitat": "Found in a wide range of habitats across the Indian subcontinent, from forests and scrublands to agricultural areas and the outskirts of villages. They are often found on the ground but are also excellent climbers.",
    "conservation_status": "Least Concern",
    "status_threats": "Illegally hunted for their meat, skin, and fat, which is used in traditional medicine. They also suffer from habitat loss and persecution by humans.",
    "description": "A large lizard that can grow over 1.5 meters (5 feet) long. They are typically grey or brownish with a powerful body, strong claws, and a forked tongue which they flick to 'smell' their surroundings. They are active during the day and are often seen basking in the sun.",
    "food": "Carnivore; an opportunistic predator with a very broad diet that includes insects, bird eggs, rodents, snakes, and carrion.",
    "region": "Indian Subcontinent and Southeast Asia",
    "image": "images/bengal_monitor.png"
  },
  {
    "id": 87,
    "name": "Koel (Asian)",
    "scientific_name": "Eudynamys scolopaceus",
    "type": "Bird",
    "habitat": "Lightly wooded country, gardens, and urban areas across the Indian subcontinent, China, and Southeast Asia. They are very common in cities with tree cover.",
    "conservation_status": "Least Concern",
    "status_threats": "No significant threats are known for this adaptable and widespread species.",
    "description": "A member of the cuckoo family, known for its loud, melodious, and persistent calls, which are a very common sound during the summer in India. The male is a glossy black, while the female is brown and heavily spotted. They are brood parasites, laying their eggs in the nests of other birds, primarily crows.",
    "food": "Frugivore; their diet consists mainly of fruits and berries, especially figs.",
    "region": "Indian Subcontinent and Southeast Asia",
    "image": "images/koel.png"
  },
  {
    "id": 88,
    "name": "Mountain Gorilla",
    "scientific_name": "Gorilla beringei beringei",
    "type": "Mammal",
    "habitat": "High-altitude montane and bamboo forests in the volcanic mountain ranges of Central Africa.",
    "conservation_status": "Endangered",
    "status_threats": "Threatened by habitat loss due to human encroachment, poaching (often from snares set for other animals), and susceptibility to human diseases.",
    "description": "A subspecies of the eastern gorilla, known for its thick, long fur that helps it survive in cold, high altitudes. They are highly social, living in stable family groups led by a dominant adult male known as a 'silverback'.",
    "food": "Herbivore; their diet consists almost entirely of vegetation such as leaves, stems, pith, and shoots of various plants.",
    "region": "Central Africa (Rwanda, Uganda, DRC)",
    "image": "images/mountain_gorilla.png"
  },
  {
    "id": 89,
    "name": "Russell's Viper",
    "scientific_name": "Daboia russelii",
    "type": "Reptile",
    "habitat": "Found in a wide variety of habitats across the Indian subcontinent and Southeast Asia, including open grassy areas, scrub jungles, and agricultural lands, often bringing it into contact with humans.",
    "conservation_status": "Least Concern",
    "status_threats": "Frequently killed by humans out of fear. They are also threatened by habitat destruction and are common victims of roadkill.",
    "description": "A highly venomous snake and a member of India's 'Big Four'. It has a stout body with a flattened, triangular head and is patterned with three rows of dark brown, chain-like spots. It is known for its incredibly loud, intimidating hiss.",
    "food": "Carnivore; primarily preys on rodents, making it ecologically beneficial to farmers, but also eats small mammals, birds, and lizards.",
    "region": "Indian Subcontinent and Southeast Asia",
    "image": "images/russells_viper.png"
  },
  {
    "id": 90,
    "name": "Adlie Penguin",
    "scientific_name": "Pygoscelis adeliae",
    "type": "Bird",
    "habitat": "Breeds on the rocky, ice-free coasts of the Antarctic continent. They spend the winter foraging in the pack ice of the surrounding seas.",
    "conservation_status": "Least Concern",
    "status_threats": "While their population is currently stable, they are considered an indicator species for climate change, which affects sea ice conditions and the availability of their prey (krill).",
    "description": "A medium-sized penguin with the classic black-and-white 'tuxedo' appearance and a distinctive white ring around its eye. They are feisty, social birds that nest in enormous, noisy colonies called 'rookeries'.",
    "food": "Carnivore; their diet consists mainly of Antarctic krill, as well as fish and squid, which they catch by pursuit-diving.",
    "region": "Antarctica",
    "image": "images/adelie_penguin.png"
  },
  {
    "id": 91,
    "name": "Chital (Spotted Deer)",
    "scientific_name": "Axis axis",
    "type": "Mammal",
    "habitat": "Grasslands and lightly forested areas throughout the Indian subcontinent. They are highly dependent on water and are usually found near water sources.",
    "conservation_status": "Least Concern",
    "status_threats": "They are a primary prey species for tigers, leopards, and dholes, so their populations are integral to the health of the ecosystem. Habitat loss is a concern, but they are abundant in protected areas.",
    "description": "Often considered one of the most beautiful deer species, with a reddish-brown coat marked with prominent white spots that they retain throughout their life. Males have long, elegant, three-tined antlers.",
    "food": "Herbivore; primarily a grazer that feeds on short grasses, but they will also browse on leaves, shoots, and fruits.",
    "region": "Indian Subcontinent",
    "image": "images/chital.png"
  },
  {
    "id": 92,
    "name": "European Mantis",
    "scientific_name": "Mantis religiosa",
    "type": "Insect",
    "habitat": "Found in temperate and tropical regions worldwide, in meadows, gardens, and areas with ample vegetation for camouflage and hunting.",
    "conservation_status": "Least Concern",
    "status_threats": "No major threats. They are considered beneficial insects as they help control populations of other, often pest, insects.",
    "description": "A predatory insect known for its distinctive 'praying' posture, with its large raptorial forelegs held together. They have a triangular head that can rotate 180 degrees, excellent vision, and are masters of ambush and camouflage.",
    "food": "Carnivore; an ambush predator that eats a wide variety of other insects, including flies, crickets, grasshoppers, and even other mantises.",
    "region": "Europe, Asia, Africa (introduced to North America)",
    "image": "images/european_mantis.png"
  },
  {
    "id": 93,
    "name": "Sambar Deer",
    "scientific_name": "Rusa unicolor",
    "type": "Mammal",
    "habitat": "Found in a wide variety of forest habitats, from tropical rainforests to deciduous forests and woodlands, across the Indian subcontinent and Southeast Asia. They prefer dense cover.",
    "conservation_status": "Vulnerable",
    "status_threats": "Populations are declining due to severe hunting pressure, both for meat and for their antlers, as well as widespread habitat loss.",
    "description": "A large deer with a shaggy, dark brown coat and a stocky build. Males have massive, rugged antlers with three tines. They are the favored prey of the Bengal tiger.",
    "food": "Herbivore; a browser and grazer with a very broad diet that includes grasses, leaves, fruits, and aquatic plants.",
    "region": "Indian Subcontinent and Southeast Asia",
    "image": "images/sambar_deer.png"
  },
  {
    "id": 94,
    "name": "Grizzly Bear",
    "scientific_name": "Ursus arctos horribilis",
    "type": "Mammal",
    "habitat": "Inland forests, alpine meadows, and river valleys of western North America. They require vast, undisturbed wilderness areas to thrive.",
    "conservation_status": "Least Concern",
    "status_threats": "While the species as a whole is stable, some populations are threatened by habitat fragmentation due to human development, human-bear conflicts, and climate change affecting food sources.",
    "description": "A large subspecies of the brown bear, known for the distinctive muscular hump on its shoulders used for digging dens and unearthing food. They are powerful apex predators with long, non-retractable claws.",
    "food": "Omnivore; has a highly varied diet that includes berries, nuts, roots, insects, salmon, and small to large mammals like rodents, elk, and moose.",
    "region": "North America",
    "image": "images/grizzly_bear.png"
  },
  {
    "id": 95,
    "name": "Gray Langur",
    "scientific_name": "Semnopithecus entellus",
    "type": "Mammal",
    "habitat": "Highly adaptable, found in a wide range of habitats across the Indian subcontinent, including forests, scrublands, and urban areas, especially around temples and villages.",
    "conservation_status": "Least Concern",
    "status_threats": "Threatened by habitat loss due to urbanization, road accidents, and electrocution from poorly insulated power lines. Human-monkey conflict can also be an issue.",
    "description": "A large monkey with mostly grey fur, a contrasting black face and ears, and a very long tail that often exceeds its body length. They are considered sacred in Hinduism, named after the deity Hanuman.",
    "food": "Herbivore; primarily a folivore (leaf-eater), their specialized stomach allows them to digest tough leaves. They also eat fruits, flowers, and buds.",
    "region": "Indian Subcontinent",
    "image": "images/gray_langur.png"
  },
  {
    "id": 96,
    "name": "Great Hammerhead Shark",
    "scientific_name": "Sphyrna mokarran",
    "type": "Fish",
    "habitat": "Found in tropical and warm temperate waters worldwide, inhabiting a range of environments from coastal zones and continental shelves to the open ocean.",
    "conservation_status": "Critically Endangered",
    "status_threats": "Severely threatened by overfishing. They are targeted for their large fins, which are highly valued in the shark fin trade, and are also frequently caught as bycatch.",
    "description": "The largest species of hammerhead shark, instantly recognizable by its unique 'hammer-shaped' head, called a cephalofoil. This structure provides a wider field of vision and is equipped with sensory organs to detect prey buried in the sand.",
    "food": "Carnivore; preys on a wide variety of fish, crustaceans, and cephalopods, but is particularly well-known for hunting and eating stingrays.",
    "region": "Worldwide tropical and temperate waters",
    "image": "images/great_hammerhead_shark.png"
  },
  {
    "id": 97,
    "name": "Wild Boar",
    "scientific_name": "Sus scrofa",
    "type": "Mammal",
    "habitat": "Extremely adaptable, found in a vast range of habitats including woodlands, forests, grasslands, and agricultural lands across Eurasia and North Africa. They are the wild ancestor of the domestic pig.",
    "conservation_status": "Least Concern",
    "status_threats": "There are no major threats to its survival; it is abundant and widespread. It is often hunted as game or managed as an agricultural pest due to the damage it causes to crops.",
    "description": "A medium-sized mammal with a stocky, powerful body, a coat of stiff bristles, and a long, straight snout for rooting in the soil. Adult males have prominent, sharp tusks that curve upwards and outwards.",
    "food": "Omnivore; an opportunistic feeder with a highly varied diet that includes roots, bulbs, fruits, nuts, insects, worms, carrion, and small animals.",
    "region": "Eurasia and North Africa (introduced worldwide)",
    "image": "images/wild_boar.png"
  },
  {
    "id": 98,
    "name": "Ocelot",
    "scientific_name": "Leopardus pardalis",
    "type": "Mammal",
    "habitat": "Found in diverse habitats, including tropical forests, mangrove swamps, and scrublands from the southwestern United States down to northern Argentina.",
    "conservation_status": "Least Concern",
    "status_threats": "Historically, their populations were decimated by the fur trade. Current threats include habitat loss and fragmentation from deforestation, and illegal poaching.",
    "description": "A medium-sized wild cat with a stunning coat marked with solid and open-centered spots (rosettes) and stripes. They are primarily nocturnal, solitary hunters and are excellent climbers and swimmers.",
    "food": "Carnivore; preys on small to medium-sized animals like rodents, rabbits, armadillos, birds, and reptiles.",
    "region": "The Americas",
    "image": "images/ocelot.png"
  },
  {
    "id": 99,
    "name": "Indian Paradise Flycatcher",
    "scientific_name": "Terpsiphone paradisi",
    "type": "Bird",
    "habitat": "Well-wooded areas, thick forests, and gardens across the Indian subcontinent and Central Asia. They prefer areas with a dense undergrowth.",
    "conservation_status": "Least Concern",
    "status_threats": "While widespread, they are threatened by habitat degradation. The migratory populations face additional risks along their migratory routes.",
    "description": "A spectacular songbird, where the adult male has a glossy black head with a crest and a very long, ribbon-like white tail that can be twice the length of its body. Females and young males are reddish-brown (rufous) with a shorter tail.",
    "food": "Insectivore; catches flying insects in mid-air with acrobatic sallies from a perch.",
    "region": "Asia",
    "image": "images/indian_paradise_flycatcher.png"
  },
  {
    "id": 100,
    "name": "Giant Anteater",
    "scientific_name": "Myrmecophaga tridactyla",
    "type": "Mammal",
    "habitat": "Grasslands, savannas, and tropical forests of Central and South America. They are terrestrial and spend their time walking on the ground.",
    "conservation_status": "Vulnerable",
    "status_threats": "Threatened by severe habitat loss from conversion to agriculture and cattle ranching. They are also frequent victims of road kills and are sometimes hunted.",
    "description": "A large, distinctive mammal with a long, tubular snout, a massive, bushy tail that it can use as a blanket, and powerful forelimbs with formidable claws. It has no teeth and uses its extremely long (up to 60 cm), sticky tongue to capture insects.",
    "food": "Myrmecophagous (insectivore); it specializes in eating ants and termites, using its claws to tear open nests and its tongue to consume tens of thousands of insects in a single day.",
    "region": "Central and South America",
    "image": "images/giant_anteater.png"
  },
  {
    "id": 101,
    "name": "King Cobra",
    "scientific_name": "Ophiophagus hannah",
    "type": "Reptile",
    "habitat": "Dense highland forests, bamboo thickets, and mangrove swamps, often near streams and rivers. They are found across the Indian subcontinent and Southeast Asia.",
    "conservation_status": "Vulnerable",
    "status_threats": "Widespread deforestation is the primary threat, destroying their habitat. They are also persecuted by humans due to fear and are illegally collected for the skin trade.",
    "description": "The world's longest venomous snake, capable of reaching over 18 feet (5.5 meters). It can raise the front third of its body off the ground, flare out a narrow hood when threatened, and is known for its remarkable intelligence. Uniquely, it is the only snake that builds a nest for its eggs.",
    "food": "Ophiophagous (carnivore); its scientific name means 'snake-eater', and its diet consists almost entirely of other snakes, including venomous ones like kraits and other cobras.",
    "region": "Indian Subcontinent and Southeast Asia",
    "image": "images/king_cobra.png"
  },
  {
    "id": 102,
    "name": "Emu",
    "scientific_name": "Dromaius novaehollandiae",
    "type": "Bird",
    "habitat": "Found in a variety of habitats across most of Australia, from savannas and grasslands to sclerophyll forests.",
    "conservation_status": "Least Concern",
    "status_threats": "While widespread, local populations are threatened by habitat fragmentation from agriculture, frequent vehicle collisions, and predation of their eggs and chicks by introduced species.",
    "description": "The second-largest living bird by height, after its relative, the ostrich. It is a flightless bird with long, powerful legs, a shaggy grey-brown plumage, and a pale blue neck and head. They are fast runners and competent swimmers.",
    "food": "Omnivore; a nomadic forager that eats a wide variety of native plants and insects, including fruits, seeds, and caterpillars, depending on seasonal availability.",
    "region": "Australia",
    "image": "images/emu.png"
  },
  {
    "id": 103,
    "name": "Clouded Leopard",
    "scientific_name": "Neofelis nebulosa",
    "type": "Mammal",
    "habitat": "Dense tropical forests in Southeast Asia and the Himalayan foothills. They are one of the most arboreal cats, spending a great deal of time in the trees.",
    "conservation_status": "Vulnerable",
    "status_threats": "Large-scale deforestation and habitat fragmentation are the primary threats. They are also heavily hunted for their stunning coats and for bones used in traditional medicine.",
    "description": "A secretive, medium-sized wild cat renowned for its stunning coat patterned with large, cloud-like blotches. It has the longest canine teeth in proportion to its body size of any living feline and is an exceptional climber, able to climb down trees head-first.",
    "food": "Carnivore; preys on a variety of arboreal and terrestrial animals, including monkeys, deer, wild pigs, and birds.",
    "region": "Southeast Asia and Himalayas",
    "image": "images/clouded_leopard.png"
  },
  {
    "id": 104,
    "name": "Star Fish",
    "scientific_name": "Asterias rubens",
    "type": "Invertebrate (Echinoderm)",
    "habitat": "Found in oceans worldwide, from the intertidal zone down to abyssal depths. They live on the seabed and can be found on rocks, coral reefs, and sand.",
    "conservation_status": "Not Evaluated",
    "status_threats": "Threatened by rising sea temperatures, ocean pollution, and diseases like Sea Star Wasting Syndrome, which has caused catastrophic die-offs in some regions.",
    "description": "A star-shaped marine invertebrate, typically with five arms radiating from a central disc, though some species have many more. They are known for their remarkable ability to regenerate lost arms and for their unique method of feeding by pushing their stomach out of their mouth.",
    "food": "Carnivore; a voracious predator that preys on bivalves like mussels and clams, as well as snails, barnacles, and other slow-moving sea life.",
    "region": "Worldwide Oceans",
    "image": "images/starfish.png"
  },
  {
    "id": 105,
    "name": "Pangolin (Indian)",
    "scientific_name": "Manis crassicaudata",
    "type": "Mammal",
    "habitat": "Found in various habitats in India, including tropical forests, grasslands, and scrublands. They are nocturnal and live in deep burrows.",
    "conservation_status": "Endangered",
    "status_threats": "They are the most trafficked mammal in the world, hunted relentlessly for their scales (used in traditional medicine) and for their meat.",
    "description": "A unique, toothless mammal covered in large, protective keratin scales. When threatened, it curls up into a tight, armored ball. They have a long, sticky tongue for catching insects.",
    "food": "Myrmecophagous (insectivore); specializes in eating ants and termites, which it locates with its strong sense of smell.",
    "region": "Indian Subcontinent",
    "image": "images/indian_pangolin.png"
  },
  {
    "id": 106,
    "name": "Secretarybird",
    "scientific_name": "Sagittarius serpentarius",
    "type": "Bird",
    "habitat": "Open grasslands and savannas of sub-Saharan Africa. They are largely terrestrial, spending most of their day hunting on foot.",
    "conservation_status": "Endangered",
    "status_threats": "Populations are declining rapidly due to habitat loss and degradation from agriculture and urban development, as well as disturbance and hunting.",
    "description": "A large, terrestrial bird of prey with an eagle-like body on crane-like legs. It is famous for the long, quill-like feathers on its head that resemble the quill pens of 19th-century secretaries, and for its unique method of hunting by stomping powerfully on its prey, especially snakes.",
    "food": "Carnivore; preys on a wide variety of animals it can find on the ground, including snakes, lizards, insects, and small mammals.",
    "region": "Africa",
    "image": "images/secretarybird.png"
  },
  {
    "id": 107,
    "name": "Saw-scaled Viper",
    "scientific_name": "Echis carinatus",
    "type": "Reptile",
    "habitat": "Arid and dry scrublands, sandy deserts, and rocky areas across Africa, the Middle East, and the Indian subcontinent.",
    "conservation_status": "Least Concern",
    "status_threats": "Frequently killed by humans due to its dangerous reputation. Habitat degradation from overgrazing and agriculture is also a concern.",
    "description": "A small but highly venomous viper and a member of India's 'Big Four'. It gets its name from the unique rasping or 'sizzling' sound it makes by rubbing its specially keeled scales together as a threat display. It is known for its fiery temperament and potent hemotoxic venom.",
    "food": "Carnivore; primarily preys on scorpions, centipedes, and large insects, but also takes small rodents, lizards, and frogs.",
    "region": "Africa, Middle East, Indian Subcontinent",
    "image": "images/saw_scaled_viper.png"
  },
  {
    "id": 108,
    "name": "Narwhal",
    "scientific_name": "Monodon monoceros",
    "type": "Mammal",
    "habitat": "Arctic waters of Canada, Greenland, Norway, and Russia. They live year-round in the Arctic, migrating with the formation and retreat of the dense sea ice.",
    "conservation_status": "Least Concern",
    "status_threats": "They are one of the mammals most vulnerable to climate change due to their reliance on sea ice. Increased shipping and industrial noise in the Arctic also interfere with their communication and navigation.",
    "description": "A medium-sized whale often called the 'unicorn of the sea' due to the single, long, spiral tusk found in males. The tusk, which is an elongated canine tooth, is a sensory organ with millions of nerve endings used to perceive the environment.",
    "food": "Carnivore; an expert deep diver that feeds on fish (like Arctic and polar cod), squid, and shrimp found on or near the dark seafloor.",
    "region": "Arctic Ocean",
    "image": "images/narwhal.png"
  },
  {
    "id": 109,
    "name": "Great Indian Bustard",
    "scientific_name": "Ardeotis nigriceps",
    "type": "Bird",
    "habitat": "Arid and semi-arid grasslands and open scrublands of the Indian subcontinent. It requires vast, undisturbed grassland ecosystems to survive.",
    "conservation_status": "Critically Endangered",
    "status_threats": "On the absolute brink of extinction with fewer than 150 individuals remaining. Threats include habitat loss to agriculture, collisions with power lines, and hunting.",
    "description": "One of the heaviest flying birds in the world. It is a large, ground-dwelling bird with long legs and a horizontal body, giving it an ostrich-like appearance. Males have a black crown and a distinctive gular pouch which they inflate during courtship displays.",
    "food": "Omnivore; its diet consists of insects (especially locusts and beetles), seeds, grains, and small reptiles.",
    "region": "India",
    "image": "images/great_indian_bustard.png"
  },
  {
    "id": 110,
    "name": "Electric Eel",
    "scientific_name": "Electrophorus electricus",
    "type": "Fish",
    "habitat": "Freshwater basins of the Amazon and Orinoco rivers in South America, preferring muddy, slow-moving, and oxygen-poor waters.",
    "conservation_status": "Least Concern",
    "status_threats": "There are no major known threats to this species. Their remote habitat protects them from most human activities.",
    "description": "A long, snake-like fish that is actually a type of knifefish, not a true eel. It is famous for its ability to generate powerful electric shocks of up to 860 volts from specialized electric organs, used for hunting, self-defense, and navigation. They are obligatory air-breathers, needing to surface for air.",
    "food": "Carnivore; preys on fish, amphibians, crustaceans, and small mammals, which it stuns or kills with a high-voltage electric discharge.",
    "region": "South America",
    "image": "images/electric_eel.png"
  },
  {
    "id": 111,
    "name": "Reindeer (Caribou)",
    "scientific_name": "Rangifer tarandus",
    "type": "Mammal",
    "habitat": "Arctic tundra, boreal forests (taiga), and mountainous regions across the Northern Hemisphere (North America, Europe, and Asia).",
    "conservation_status": "Vulnerable",
    "status_threats": "Populations are declining due to the impacts of climate change on their food supply and habitat. Habitat loss and disturbance from industrial development are also major threats.",
    "description": "A species of deer unique in that both males and females regularly grow antlers. They have a thick, insulating coat and large, crescent-shaped hooves that provide traction in snow and soft tundra. They are well-known for their epic long-distance migrations.",
    "food": "Herbivore; feeds on grasses, sedges, and leaves in the summer, and relies heavily on lichens (reindeer moss) during the winter, which they dig for in the snow.",
    "region": "Northern Hemisphere (Arctic and Subarctic)",
    "image": "images/reindeer.png"
  },
  {
    "id": 112,
    "name": "Alpine Musk Deer",
    "scientific_name": "Moschus chrysogaster",
    "type": "Mammal",
    "habitat": "High-altitude forests and scrublands in the Himalayas of India, Nepal, and China. They are solitary and secretive.",
    "conservation_status": "Endangered",
    "status_threats": "Severely threatened by intense and illegal poaching for the male's musk gland, which is highly valued in the international perfume and traditional medicine industries. Habitat degradation is also a threat.",
    "description": "A small, primitive deer-like mammal that is not a true deer. They lack antlers, but males possess long, tusk-like canine teeth that protrude from their mouth. They are named for the strong-smelling musk secreted by a gland in the male's abdomen.",
    "food": "Herbivore; a browser that feeds on a selective diet of leaves, flowers, grasses, mosses, and lichens.",
    "region": "Himalayas (Asia)",
    "image": "images/alpine_musk_deer.png"
  },
  {
    "id": 113,
    "name": "Firefly",
    "scientific_name": "Lampyridae (family)",
    "type": "Insect",
    "habitat": "Fields, forests, and marshy areas worldwide. They are common in warm, humid environments, especially during the monsoon season in places like the Western Ghats.",
    "conservation_status": "Not Evaluated",
    "status_threats": "Populations are believed to be declining globally due to habitat loss (development of fields and wetlands) and light pollution, which disrupts their bioluminescent mating signals.",
    "description": "A winged beetle, also known as a lightning bug, famous for its remarkable ability to produce 'cold light' through bioluminescence. This light is used by adults to attract mates, with each species having a unique flashing pattern to avoid confusion.",
    "food": "Larvae are carnivorous, feeding on snails, slugs, and worms. Many adult species do not feed at all during their short lifespan, while some consume nectar or pollen.",
    "region": "Worldwide",
    "image": "images/firefly.png"
  },
  {
    "id": 114,
    "name": "Indian Flying Fox",
    "scientific_name": "Pteropus medius",
    "type": "Mammal",
    "habitat": "Tropical forests and swamps, famously roosting in large, noisy colonies on massive trees in both urban and rural areas across the Indian subcontinent.",
    "conservation_status": "Least Concern",
    "status_threats": "Threatened by hunting for their meat (which is erroneously believed to have medicinal value) and persecution by fruit farmers. The loss of large, old roosting trees is also a significant problem.",
    "description": "One of the largest bat species in the world, with a wingspan of up to 1.5 meters (5 ft). They have a fox-like face and large eyes. Unlike smaller bats, they do not use echolocation, relying instead on well-developed sight and smell to find food. They are crucial pollinators and seed dispersers.",
    "food": "Frugivore; they feed almost exclusively on ripe fruits like mangoes, guavas, and figs, as well as nectar from flowers.",
    "region": "Indian Subcontinent",
    "image": "images/indian_flying_fox.png"
  },
  {
    "id": 115,
    "name": "Wolverine",
    "scientific_name": "Gulo gulo",
    "type": "Mammal",
    "habitat": "Boreal forests (taiga), alpine tundra, and remote northern wilderness across the Northern Hemisphere. They require large, isolated territories with deep snowpack for denning.",
    "conservation_status": "Least Concern",
    "status_threats": "Threatened by habitat fragmentation, climate change which reduces the spring snowpack they need for reproductive dens, and trapping in some regions.",
    "description": "The largest and most formidable terrestrial member of the weasel family, renowned for its strength, ferocity, and endurance in harsh climates. It has a stocky, muscular build and powerful jaws capable of crushing frozen meat and bone.",
    "food": "Omnivore; primarily a scavenger of large animal carcasses, but also a capable predator that hunts rodents, hares, and even animals as large as caribou when conditions are favorable.",
    "region": "Northern Hemisphere",
    "image": "images/wolverine.png"
  },
  {
    "id": 116,
    "name": "Koala",
    "scientific_name": "Phascolarctos cinereus",
    "type": "Mammal",
    "habitat": "Eucalyptus forests in eastern and southeastern Australia",
    "conservation_status": "Endangered",
    "status_threats": "Habitat loss, bushfires, disease, vehicle collisions",
    "description": "Arboreal marsupial with stout body, fluffy ears, and thick fur. Mostly sedentary, sleeping up to 20 hours a day. Males bellow to attract mates.",
    "food": "Primarily eucalyptus leaves, obtaining most water from them",
    "region": "Eastern and southeastern Australia",
    "image": "images/koala.png"
  },
  {
    "id": 117,
    "name": "Rabbit",
    "scientific_name": "Oryctolagus cuniculus",
    "type": "Mammal",
    "habitat": "Grasslands, agricultural pastures, sand dunes, and woodlands with burrows",
    "conservation_status": "Near Threatened",
    "status_threats": "Disease, habitat loss, competition, overgrazing",
    "description": "Small burrowing mammal, social, mostly nocturnal. Known for rapid reproduction and forming large colonies.",
    "food": "Grasses, leaves, buds, bark, and roots",
    "region": "Native to Europe and northwest Africa; introduced elsewhere",
    "image": "images/rabbit.png"
  }
]